Revit 2024 API
FieldDomainPointsByXYZ Constructor
 Creates object from an array of three-dimensional point coordinates
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FieldDomainPointsByXYZ(
	IList<XYZ> points
)
Visual Basic
Public Sub New ( _
	points As IList(Of XYZ) _
)
Visual C++
public:
FieldDomainPointsByXYZ(
	IList<XYZ^>^ points
)
Parameters
points
Type: System.Collections.Generic.IList<XYZ>
 Array of three-dimensional point coordinates representing domain points
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when supplied array points contain too many members (over 1000)
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FieldDomainPointsByXYZ Class
Autodesk.Revit.DB.Analysis Namespace